Tekla Open API Reference for Tekla Structures 2025
DistanceList.ToArray Method
 Copies the contents of the list into a new array.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Distance[] ToArray()
Public Function ToArray As Distance()
Return Value
Type: Distance[]
The array of distances.
Examples
 This example shows how to copy the Distance instances in a DistanceList to a new array.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           DistanceList distanceList = new DistanceList(distances);
           // We can copy the list contents to a new array. This allows us to
           // enumerate the contents even if the list changes during the enumeration.
           Distance[] distancesInArray = distanceList.ToArray();
           foreach(Distance distance in distancesInArray)
           {
               string formattedDistance = distance.ToString();
           }
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace